Tarea1/DifusorLS1RS2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Difusor bidimensional (Tarea 1, problema 3).+

#include "${FOAM_CASE}/constant/Parametros"
// Lo que hago es colocar todos los puntos clave
zBack   #calc "0.1 * $H";   // espesor en z (caso 2D) [m]

x0      0;
x1      $LS;
x2      #calc "$LS + $Ldiff";
x3      #calc "$LS + $Ldiff + $RS";

yTop    $Hout;                // pared superior: constante en todo el dominio
y0In    #calc "$Hout - $H";   // pared inferior en el tramo de entrada (= H)
y0Out   0;                    // pared inferior en el tramo de salida  (= 0)

z0      0;
z1      $zBack;

// Discretizacion: tamano de celda objetivo, escalado con H
dx      #calc "$H / 50.0";  // tramos rectos
dxDiff  #calc "$H / 100.0";  // rampa del difusor (malla mas fina)

nx1     #calc "label(round($LS / $dx))";       // celdas tramo recto de entrada (izquierdo)
nx2     #calc "label(round($Ldiff / $dxDiff))"; // celdas rampa del difusor
nx3     #calc "label(round($RS / $dx))";       // celdas tramo recto de salida (derecho)
ny      100;     // celdas en altura (comun a los 3 bloques)
nz      1;      // celdas en z (caso 2D)

// Refinamiento hacia ambas paredes (superior e inferior)
yGrading simpleGrading (1 ((0.5 0.5 4)(0.5 0.5 0.25)) 1);

vertices
(
    ($x0 $y0In  $z0)   // 0
    ($x0 $y0In  $z1)   // 1
    ($x0 $yTop  $z0)   // 2
    ($x0 $yTop  $z1)   // 3

    ($x1 $y0In  $z0)   // 4
    ($x1 $y0In  $z1)   // 5
    ($x1 $yTop  $z0)   // 6
    ($x1 $yTop  $z1)   // 7

    ($x2 $y0Out $z0)   // 8
    ($x2 $y0Out $z1)   // 9
    ($x2 $yTop  $z0)   // 10
    ($x2 $yTop  $z1)   // 11

    ($x3 $y0Out $z0)   // 12
    ($x3 $y0Out $z1)   // 13
    ($x3 $yTop  $z0)   // 14
    ($x3 $yTop  $z1)   // 15
);

blocks
(
    hex (0 4 6 2 1 5 7 3)       ($nx1 $ny $nz) $yGrading
    hex (4 8 10 6 5 9 11 7)     ($nx2 $ny $nz) $yGrading
    hex (8 12 14 10 9 13 15 11) ($nx3 $ny $nz) $yGrading
);

edges
(
);

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 2 3 1)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (12 13 15 14)
        );
    }

    lowerWall
    {
        type    wall;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
        );
    }

    upperWall
    {
        type    wall;
        faces
        (
            (2 6 7 3)
            (6 10 11 7)
            (10 14 15 11)
        );
    }

    frontAndBack
    {
        type    empty;
        faces
        (
            (0 4 6 2)
            (4 8 10 6)
            (8 12 14 10)
            (1 3 7 5)
            (5 7 11 9)
            (9 11 15 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
